# GetRebarConstraintTargetHostFaceType Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarConstraint..::..GetRebarConstraintTargetHostFaceType Method
RebarConstraint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetRebarConstraintTargetHostFaceType()()()() | Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' Will throw exception if it's a multi target constraint. |
| GetRebarConstraintTargetHostFaceType(Int32) | Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.' |

# See Also
RebarConstraint Class
RebarConstraint Members
Autodesk.Revit.DB.Structure Namespace